<template>
  <div id="id4" :class="className" :style="{height:height,width:width}" />
</template>

<script>
    import echarts from 'echarts'
    export default {
      props: {
        className: {
          type: String,
          default: 'chart'
        },
        id: {
          type: String,
          default: 'chart'
        },
        width: {
          type: String,
          default: '200px'
        },
        height: {
          type: String,
          default: '200px'
        }
      },
      data() {
        return {
          chart:null,
        }
      },
      mounted() {
        //初始化echarts图表实例
        this.chart = echarts.init(document.getElementById("id4"));

        var dataMap = {};
        function dataFormatter(obj) {
          var pList = ['北京','天津','河北','山西','内蒙古','辽宁','吉林','黑龙江','上海','江苏','浙江','安徽','福建','江西','山东','河南','湖北','湖南','广东','广西','海南','重庆','四川','贵州','云南','西藏','陕西','甘肃','青海','宁夏','新疆'];
          var temp;
          for (var year = 2015; year <= 2019; year++) {
            var max = 0;
            var sum = 0;
            temp = obj[year];
            for (var i = 0, l = temp.length; i < l; i++) {
              max = Math.max(max, temp[i]);
              sum += temp[i];
              obj[year][i] = {
                name : pList[i],
                value : temp[i]
              }
            }
            obj[year + 'max'] = Math.floor(max / 100) * 100;
            obj[year + 'sum'] = sum;
          }
          return obj;
        }


        dataMap.dataPI = dataFormatter({
          //max : 4000,
          2019:[136.27,159.72,2905.73,641.42,1306.3,1915.57,1277.44,1701.5,124.94,3064.78,1583.04,2015.31,1612.24,1391.07,3973.85,3512.24,2569.3,2768.03,2665.2,2047.23,659.23,844.52,2983.51,726.22,1411.01,74.47,1220.9,678.75,155.08,184.14,1139.03],
          2018:[124.36,145.58,2562.81,554.48,1095.28,1631.08,1050.15,1302.9,114.15,2540.1,1360.56,1729.02,1363.67,1206.98,3588.28,3258.09,2147,2325.5,2286.98,1675.06,539.83,685.38,2482.89,625.03,1108.38,68.72,988.45,599.28,134.92,159.29,1078.63],
          2017:[118.29,128.85,2207.34,477.59,929.6,1414.9,980.57,1154.33,113.82,2261.86,1163.08,1495.45,1182.74,1098.66,3226.64,2769.05,1795.9,1969.69,2018.27,1458.49,462.19,606.8,2240.61,550.27,1067.6,63.88,789.64,497.05,107.4,127.25,759.74],
          2016:[112.83,122.58,2034.59,313.58,907.95,1302.02,916.72,1088.94,111.8,2100.11,1095.96,1418.09,1158.17,1060.38,3002.65,2658.78,1780,1892.4,1973.05,1453.75,436.04,575.4,2216.15,539.19,1020.56,60.62,753.72,462.27,105.57,118.94,691.07],
          2015:[101.26,110.19,1804.72,311.97,762.1,1133.42,783.8,915.38,101.84,1816.31,986.02,1200.18,1002.11,905.77,2509.14,2217.66,1378,1626.48,1695.57,1241.35,361.07,482.39,2032,446.38,837.35,54.89,592.63,387.55,83.41,97.89,628.72],
        });

        dataMap.dataSI = dataFormatter({
          //max : 26600,
          2019:[3752.48,5928.32,13126.86,6635.26,8037.69,12152.15,5611.48,5962.41,7927.89,25203.28,16555.58,8309.38,9069.2,6390.55,24017.11,15427.08,9815.94,9361.99,26447.38,5675.32,714.5,5543.04,11029.13,2194.33,3780.32,208.79,6935.59,2377.83,975.18,1056.15,3225.9],
          2018:[3388.38,4840.23,10707.68,5234,6367.69,9976.82,4506.31,5025.15,7218.32,21753.93,14297.93,6436.62,7522.83,5122.88,21238.49,13226.38,7767.24,7343.19,23014.53,4511.68,571,4359.12,8672.18,1800.06,3223.49,163.92,5446.1,1984.97,744.63,827.91,2592.15],
          2017:[2855.55,3987.84,8959.83,3993.8,5114,7906.34,3541.92,4060.72,6001.78,18566.37,11908.49,4905.22,6005.3,3919.45,18901.83,11010.5,6038.08,5687.19,19419.7,3381.54,443.43,3448.77,6711.87,1476.62,2582.53,136.63,4236.42,1527.24,575.33,662.32,1929.59],
          2016:[2626.41,3709.78,8701.34,4242.36,4376.19,7158.84,3097.12,4319.75,6085.84,16993.34,11567.42,4198.93,5318.44,3554.81,17571.98,10259.99,5082.07,5028.93,18502.2,3037.74,423.55,3057.78,5823.39,1370.03,2452.75,115.56,3861.12,1470.34,557.12,609.98,2070.76],
          2015:[2509.4,2892.53,7201.88,3454.49,3193.67,5544.14,2475.45,3695.58,5571.06,14471.26,10154.25,3370.96,4476.42,2975.53,14647.53,8282.83,4143.06,3977.72,16004.61,2425.29,364.26,2368.53,4648.79,1124.79,2038.39,98.48,2986.46,1279.32,419.03,455.04,1647.55],
        });

        dataMap.dataTI = dataFormatter({
          //max : 25000,
          2019:[12363.18,5219.24,8483.17,3960.87,5015.89,8158.98,3679.91,4918.09,11142.86,20842.21,14180.23,4975.96,6878.74,3921.2,17370.89,7991.72,7247.02,7539.54,24097.7,3998.33,1148.93,3623.81,7014.04,2781.29,3701.79,322.57,4355.81,1963.79,540.18,861.92,2245.12],
          2018:[10600.84,4238.65,7123.77,3412.38,4209.03,6849.37,3111.12,4040.55,9833.51,17131.45,12063.82,4193.69,5850.62,3121.4,14343.14,6607.89,6053.37,6369.27,20711.55,3383.11,953.67,2881.08,6030.41,2177.07,2892.31,274.82,3688.93,1536.5,470.88,702.45,1766.69],
          2017:[9179.19,3405.16,6068.31,2886.92,3696.65,5891.25,2756.26,3371.95,8930.85,13629.07,9918.78,3662.15,5048.49,2637.07,11768.18,5700.91,5127.12,5402.81,18052.59,2919.13,748.59,2474.44,5198.8,1885.79,2519.62,240.85,3143.74,1363.27,398.54,563.74,1587.72],
          2016:[8375.76,2886.65,5276.04,2759.46,3212.06,5207.72,2412.26,2905.68,7872.23,11888.53,8799.31,3234.64,4346.4,2355.86,10358.64,5099.76,4466.85,4633.67,16321.46,2529.51,643.47,2160.48,4561.69,1652.34,2218.81,218.67,2699.74,1234.21,355.93,475,1421.38],
          2015:[7236.15,2250.04,4600.72,2257.99,2467.41,4486.74,2025.44,2493.04,6821.11,9730.91,7613.46,2789.78,3770,1918.95,8620.24,4511.97,3812.34,3835.4,14076.83,2156.76,528.84,1825.21,3881.6,1312.94,1896.78,188.06,2178.2,1037.11,294.91,366.18,1246.89],
        });

        const option = {
          baseOption: {
            timeline: {
              // y: 0,
              axisType: 'category',
              // realtime: false,
              // loop: false,
              autoPlay: true,
              // currentIndex: 2,
              playInterval: 2000,
              // controlStyle: {
              //     position: 'left'
              // },
              data: [
                '2015-01-01',
                {
                  value: '2016-01-01',
                  tooltip: {
                    formatter: '{b} 销售额达到一个高度'
                  },
                  symbol: 'diamond',
                  symbolSize: 16
                },
                '2017-01-01','2018-01-01',
                {
                  value: '2019-01-01',
                  tooltip: {
                    formatter: function (params) {
                      return params.name + '销售额再创新高';
                    }
                  },
                  symbol: 'diamond',
                  symbolSize: 18
                },
              ],
              label: {
                formatter : function(s) {
                  return (new Date(s)).getFullYear();
                }
              }
            },
            title: {
              subtext: ''
            },
            tooltip: {
              trigger: 'item',
              formatter: "{a} <br/>{b}: {c} ({d}%)"
            },
            toolbox: {
              x:'left',
              y:'top',
              feature: {
                dataView: {show: true, readOnly: false},
                restore: {show: true},
                saveAsImage: {show: true}
              }
            },
            legend: {
              x: 'right',
              y: 'center',
              orient: 'vertical',
              data: ['畅越冰激凌', '承诺低消', '传统套餐'],
            },
            calculable : true,
            grid: {
              top: 80,
              bottom: 100,
              tooltip: {
                trigger: 'axis',
                axisPointer: {
                  type: 'shadow',
                  label: {
                    show: true,
                    formatter: function (params) {
                      return params.value.replace('\n', '');
                    }
                  }
                }
              }
            },
            xAxis: [
              {
                'type':'category',
                'axisLabel':{'interval':0},
                'data':[
                  '北京','\n天津','河北','\n山西','内蒙古','\n辽宁','吉林','\n黑龙江',
                  '上海','\n江苏','浙江','\n安徽','福建','\n江西','山东','\n河南',
                  '湖北','\n湖南','广东','\n广西','海南','\n重庆','四川','\n贵州',
                  '云南','\n西藏','陕西','\n甘肃','青海','\n宁夏','新疆'
                ],
                splitLine: {show: false}
              }
            ],
            yAxis: [
              {
                type: 'value',
                name: '销售额（百万元）'
              }
            ],
            series: [
              {name: '畅越冰激凌', type: 'bar'},
              {name: '承诺低消', type: 'bar'},
              {name: '传统套餐', type: 'bar'},
              {
                name: '售出占比',
                type: 'pie',
                center: ['75%', '20%'],
                radius: '28%',
                z: 100
              }
            ]
          },
          options: [
            {
              title : {text: '2015全国销售数据',x:'center'},
              series : [
                {data: dataMap.dataPI['2015']},
                {data: dataMap.dataSI['2015']},
                {data: dataMap.dataTI['2015']},
                {data: [
                    {name: '畅越冰激凌', value: dataMap.dataPI['2015sum']},
                    {name: '承诺低消', value: dataMap.dataSI['2015sum']},
                    {name: '传统套餐', value: dataMap.dataTI['2015sum']}
                  ]}
              ]
            },
            {
              title : {text: '2016全国销售数据',x:'center'},
              series : [
                {data: dataMap.dataPI['2016']},
                {data: dataMap.dataSI['2016']},
                {data: dataMap.dataTI['2016']},
                {data: [
                    {name: '畅越冰激凌', value: dataMap.dataPI['2016sum']},
                    {name: '承诺低消', value: dataMap.dataSI['2016sum']},
                    {name: '传统套餐', value: dataMap.dataTI['2016sum']}
                  ]}
              ]
            },
            {
              title : {text: '2017全国销售数据',x:'center'},
              series : [
                {data: dataMap.dataPI['2017']},
                {data: dataMap.dataSI['2017']},
                {data: dataMap.dataTI['2017']},
                {data: [
                    {name: '畅越冰激凌', value: dataMap.dataPI['2017sum']},
                    {name: '承诺低消', value: dataMap.dataSI['2017sum']},
                    {name: '传统套餐', value: dataMap.dataTI['2017sum']}
                  ]}
              ]
            },
            {
              title : {text: '2018全国销售数据',x:'center'},
              series : [
                {data: dataMap.dataPI['2018']},
                {data: dataMap.dataSI['2018']},
                {data: dataMap.dataTI['2018']},
                {data: [
                    {name: '畅越冰激凌', value: dataMap.dataPI['2018sum']},
                    {name: '承诺低消', value: dataMap.dataSI['2018sum']},
                    {name: '传统套餐', value: dataMap.dataTI['2018sum']}
                  ]}
              ]
            },
            {
              title : {text: '2019全国销售数据',x:'center'},
              series : [
                {data: dataMap.dataPI['2019']},
                {data: dataMap.dataSI['2019']},
                {data: dataMap.dataTI['2019']},
                {data: [
                    {name: '畅越冰激凌', value: dataMap.dataPI['2019sum']},
                    {name: '承诺低消', value: dataMap.dataSI['2019sum']},
                    {name: '传统套餐', value: dataMap.dataTI['2019sum']}
                  ]}
              ]
            }
          ]
        };

        //完成图表绘制的配置
        this.chart.setOption(option);

      }
    }
</script>

<style>

</style>
